# Pull from SQL

In [2]:
#Setup, pull conda profile prior to running
from sqlalchemy import create_engine
from getpass import getpass
import pandas as pd
engine = create_engine(
    (("mysql+pymysql://root:")+getpass()+("@localhost/sakila")),
    echo=True,
)
#engine

········

In [ ]:
# for reference, do not run!
SELECT rentals_may.customer_id, count(rentals_may.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName
FROM sakila.rentals_may
JOIN customer ON rentals_may.customer_id = customer.customer_id
group by customer_id order by count desc

In [ ]:
# for reference, do not run!
df = pd.read_sql('SELECT * FROM table_name', con=db_connection)

# Check the number of rentals for each customer for May

In [3]:
#Creating May Dataframe
maydf = pd.read_sql(
    "select rentals_may.customer_id, count(rentals_may.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_may JOIN customer ON rentals_may.customer_id = customer.customer_id group by customer_id order by count desc", 
    con=engine)
#Checking May Dataframe Head
maydf

2021-01-22 13:27:19,001 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'sql_mode'
2021-01-22 13:27:19,002 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,005 INFO sqlalchemy.engine.base.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2021-01-22 13:27:19,006 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,008 INFO sqlalchemy.engine.base.Engine SELECT DATABASE()
2021-01-22 13:27:19,009 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,010 INFO sqlalchemy.engine.base.Engine show collation where `Charset` = 'utf8mb4' and `Collation` = 'utf8mb4_bin'
2021-01-22 13:27:19,011 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,013 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS CHAR(60)) AS anon_1
2021-01-22 13:27:19,013 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,015 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS CHAR(60)) AS anon_1
2021-01-22 13:27:19,015 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,017 INFO sqlalchemy.engine.base.Engine SELECT CAST('test collated returns' AS CHAR CHARACTER SET utf8mb4) COLLATE utf8mb4_bin AS anon_1
2021-01-22 13:27:19,018 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,020 INFO sqlalchemy.engine.base.Engine DESCRIBE `select rentals_may.customer_id, count(rentals_may.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_may JOIN customer ON rentals_may.customer_id = customer.customer_id group by customer_id order by count desc`
2021-01-22 13:27:19,021 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:19,022 INFO sqlalchemy.engine.base.Engine ROLLBACK
2021-01-22 13:27:19,024 INFO sqlalchemy.engine.base.OptionEngine select rentals_may.customer_id, count(rentals_may.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_may JOIN customer ON rentals_may.customer_id = customer.customer_id group by customer_id order by count desc
2021-01-22 13:27:19,025 INFO sqlalchemy.engine.base.OptionEngine {}

     customer_id  count  FirstName   LastName
0            197      8        SUE     PETERS
1            506      7     LESLIE     SEWARD
2            109      7       EDNA       WEST
3            269      6  CASSANDRA    WALTERS
4            239      6     MINNIE     ROMERO
..           ...    ...        ...        ...
515          431      1       JOEL  FRANCISCO
516          351      1       JACK      FOUST
517           10      1    DOROTHY     TAYLOR
518          136      1      ANITA    MORALES
519           61      1  KATHERINE     RIVERA

[520 rows x 4 columns]

# Check the number of rentals for each customer for June

In [4]:
#Creating June Dataframe
junedf = pd.read_sql(
    "SELECT rentals_june.customer_id, count(rentals_june.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_june JOIN customer ON rentals_june.customer_id = customer.customer_id group by customer_id order by count desc", 
    con=engine)
#Checking June Dataframe Head
junedf

2021-01-22 13:27:22,178 INFO sqlalchemy.engine.base.Engine DESCRIBE `SELECT rentals_june.customer_id, count(rentals_june.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_june JOIN customer ON rentals_june.customer_id = customer.customer_id group by customer_id order by count desc`
2021-01-22 13:27:22,179 INFO sqlalchemy.engine.base.Engine {}
2021-01-22 13:27:22,180 INFO sqlalchemy.engine.base.Engine ROLLBACK
2021-01-22 13:27:22,182 INFO sqlalchemy.engine.base.OptionEngine SELECT rentals_june.customer_id, count(rentals_june.rental_id) as count, customer.first_name as FirstName, customer.last_name as LastName FROM sakila.rentals_june JOIN customer ON rentals_june.customer_id = customer.customer_id group by customer_id order by count desc
2021-01-22 13:27:22,182 INFO sqlalchemy.engine.base.OptionEngine {}

     customer_id  count FirstName     LastName
0             31     11    BRENDA       WRIGHT
1            454     10      ALEX      GRESHAM
2            329      9     FRANK     WAGGONER
3            295      9     DAISY        BATES
4            561      9       IAN        STILL
..           ...    ...       ...          ...
585          425      1   FRANCIS        SIKES
586          412      1     ALLEN  BUTTERFIELD
587          335      1   GREGORY      MAULDIN
588           22      1     LAURA    RODRIGUEZ
589          126      1     ELLEN      SIMPSON

[590 rows x 4 columns]

# Write a function that checks if customer borrowed more or less books in the month of June as compared to May.

In [24]:
#merge dataframes for comparison
#compare_df = pd.merge(maydf,junedf,on='customer_id') #inner join
compare_df = pd.merge(maydf,junedf,on='customer_id', how='outer')
compare_df

,customer_id,count_x,firstname_x,lastname_x,count_y,firstname_y,lastname_y
0,197,8.0,SUE,PETERS,8.0,SUE,PETERS
1,506,7.0,LESLIE,SEWARD,5.0,LESLIE,SEWARD
2,109,7.0,EDNA,WEST,5.0,EDNA,WEST
3,269,6.0,CASSANDRA,WALTERS,3.0,CASSANDRA,WALTERS
4,239,6.0,MINNIE,ROMERO,5.0,MINNIE,ROMERO
...,...,...,...,...,...,...,...
593,63,NaN,NaN,NaN,1.0,ASHLEY,RICHARDSON
594,598,NaN,NaN,NaN,1.0,WADE,DELVALLE
595,487,NaN,NaN,NaN,1.0,HECTOR,POINDEXTER
596,555,NaN,NaN,NaN,1.0,DWIGHT,LOMBARDI
597,335,NaN,NaN,NaN,1.0,GREGORY,MAULDIN

In [32]:
#logic for May or June
import numpy as np
compare_df['May or June?'] = np.where(compare_df['count_x'] > compare_df['count_y'], 'May','June')

In [45]:
#logic for equal values
compare_df.loc[(compare_df['count_x'] == compare_df['count_y']),'May or June?']='Equal'

In [52]:
def getMayJune(df):
    df1 = df
    df1.set_index('customer_id', inplace=True)
    customer_id= input("Please input ID: ")
    try:
        print(df1.loc[int(customer_id), 'May or June?'])
    except:
        return 'ID Not Found'

In [53]:
#pull new dataframe with new column showing which month (May/June) they rented 
compare_df

,customer_id,count_x,firstname_x,lastname_x,count_y,firstname_y,lastname_y,May or June?
0,197,8.0,SUE,PETERS,8.0,SUE,PETERS,Equal
1,506,7.0,LESLIE,SEWARD,5.0,LESLIE,SEWARD,May
2,109,7.0,EDNA,WEST,5.0,EDNA,WEST,May
3,269,6.0,CASSANDRA,WALTERS,3.0,CASSANDRA,WALTERS,May
4,239,6.0,MINNIE,ROMERO,5.0,MINNIE,ROMERO,May
...,...,...,...,...,...,...,...,...
593,63,NaN,NaN,NaN,1.0,ASHLEY,RICHARDSON,June
594,598,NaN,NaN,NaN,1.0,WADE,DELVALLE,June
595,487,NaN,NaN,NaN,1.0,HECTOR,POINDEXTER,June
596,555,NaN,NaN,NaN,1.0,DWIGHT,LOMBARDI,June
597,335,NaN,NaN,NaN,1.0,GREGORY,MAULDIN,June